Test/ToolOpenFoamExample14/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Default_Boundary_Region
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            flowRateInletVelocity;
        //flowRate        constant 0.0;
        flowRate        constant 0.1;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        //type            pressureDirectedInletOutletVelocity;
        inletDirection  uniform (0 0 0);
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
}


// ************************************************************************* //
